---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalElement
source: html/e6a6d29a-9c26-2b3b-996e-213ae906a3af.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement

Base class for a structural analytical elements.
 AnalyticalElement represents the analytical portion of a given Structural Element.

## Syntax (C#)
```csharp
public class AnalyticalElement : Element
```